dataset_gen/Earlier_Datasets/Hole_Location_Change/CE_CRP_openfoam/Design_Point_0_copy_2/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16320
(
0.00390625
0.0117187
0.0195312
0.0273437
0.0351562
0.0429687
0.0507812
0.0585937
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.886718
0.894531
0.902343
0.910156
0.917968
0.925781
0.933593
0.941406
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
