dataset_gen/Earlier_Datasets/Hole_Location_Change/CE_CRP_openfoam/Design_Point_0_copy_2/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  8
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}

dimensions      [1 -3 0 0 0 0 0];
internalField   nonuniform List<scalar>
16320
(
    0.691584
    0.691584
    0.691584
    0.482639
    0.482639
    0.482639
    0.482639
    0.482639
...
);

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
